W5D1/goal_setter_app/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(params_users)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "HF-09SIFA_Ez2L8w1ltaig"], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(session_token: session[:session_token])